# <Center><u>Books Core</u>
Authored by: Eric N Valdez

Date: 1/17/2024

## <u>Part 1

<center><img src = "DATA/books ERD.png">

## <u> Part 2
- Generate Forward Engineering Script

## <u>Part 3

In [1]:
#Imports
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open('/Users/Valde/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
users_url = "Data/users  - users.csv"
users = pd.read_csv(users_url)
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [4]:
books_url = "Data/books - books.csv"
books = pd.read_csv(books_url)
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [5]:
authors_url = "Data/authors - authors.csv"
authors = pd.read_csv(authors_url)
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [6]:
favorites_url = "Data/favorites - favorites.csv"
favorites = pd.read_csv(favorites_url)
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [7]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/books"
engine = create_engine(connection)

In [8]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [9]:
q = '''DESCRIBE users;'''
pd.read_sql(q, engine)

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None
4  created_at     datetime  YES         None
5  updated_at     datetime  YES         None

In [10]:
q = '''DESCRIBE books;'''
pd.read_sql(q, engine)

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1       title  varchar(45)  YES         None
2   author_id          int  YES         None
3  created_at     datetime  YES         None
4  updated_at     datetime  YES         None

In [11]:
q = '''DESCRIBE favorites;'''
pd.read_sql(q, engine)

     Field Type Null  Key Default Extra
0  book_id  int   NO  PRI    None
1  user_id  int   NO  PRI    None

In [12]:
q = '''DESCRIBE authors;'''
pd.read_sql(q, engine)

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None
2   created_at     datetime  YES         None
3   updated_at     datetime  YES         None

In [13]:
books.to_sql('books', engine, index=False, if_exists = 'append')

6

In [14]:
users.to_sql('users', engine, index=False, if_exists = 'append')

3

In [15]:
favorites.to_sql('favorites', engine, index=False, if_exists = 'append')

7

In [16]:
authors.to_sql('authors', engine, index=False, if_exists = 'append')

5

- Checking the setting for FOREIGN_KEY_CHECKS (I should not have any)
- All of my foreign checkes were checked when I forward engineered it in sql

## <u>Part 4
- Testing the Database

In [20]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1